Ben_Harvey-Resume.tex
% Created 2021-06-06 Sun 19:11
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{}
\title{Ben Harvey - Resume\\\medskip
\large Email: ben@harvey.onl}
\hypersetup{
 pdfauthor={Ben Harvey},
 pdftitle={Ben Harvey - Resume},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
Currently living and working in Newcastle NSW, Australia, I am a developer with a love for all things technology. I specialize as a full-stack engineer and have experience in developing solutions for both frontend and backend. My passion for innovative software solutions is supported by regular professional learning opportunities, undertaken in my personal time, which demonstrate I have a strong drive to stay at the forefront of web-based technologies. I am pragmatic in my approach to solving solutions and pride myself on finding simple solutions that fit the business need.

Having worked extensively in teams of software developers I am comfortable communicating over a range of mediums including; face to face, video and voice conference and text based applications. During my career I have worked with a range of multiple cross -functional teams and find I have a natural aptitude when collaborating on everything from project design phases to technical architecture and implementation.

\section*{Skills}
\label{sec:org528a090}

During my career I been exposed to a number of different technology stacks. I feel confident both build new projects and maintaining existing projects using the following:

\subsection*{Frontend}
\label{sec:org502c5d1}

I have gained experience over many projects using a range of frontend technologies, these include:

\begin{itemize}
\item React
\item Angular
\item Typescript
\item HTML
\item CSS
\item Various testing frameworks
\begin{itemize}
\item Mocha
\item Sinon
\item Jest
\end{itemize}
\end{itemize}

\subsection*{Backend}
\label{sec:org90fdbcf}

I have demonstrated my robust experience in the following languages and frameworks:

\begin{itemize}
\item NodeJS
\begin{itemize}
\item Express
\end{itemize}
\item Typescript
\item C\# .net framework / .NET core
\item Python
\begin{itemize}
\item Django
\end{itemize}
\item SQL
\begin{itemize}
\item Postgres
\item MSSQL
\end{itemize}
\item Go
\end{itemize}

\subsection*{Infrastructure and DevOps}
\label{sec:org824a7a4}

\subsubsection*{General}
\label{sec:org2479403}

Through my career I not only been involved with writing application but have enjoyed being involved with running applications. I have experience deploy, maintaing and monitoring application on a number of platform. Any deployment of code should start with a code first and Infrastructure as code approach, I have experience using the following IaaC (infrastructure as code) and configuration management tools:

\begin{itemize}
\item Terraform
\item Ansible
\item AWS cloud formation
\item Docker
\begin{itemize}
\item Writing docker files for both development environments and deployment to production
\item Docker-compose for orchestrating environments for development and testing
\end{itemize}
\end{itemize}

\subsubsection*{AWS Cloud infrastrucutre}
\label{sec:org1a45da8}

I have used AWS cloud services to deploy and run cloud native applications and have exemplary knowledge and understanding of the following:

\begin{itemize}
\item Deploying applications using ECS
\item AWS Lamba and API gateway
\item RDS
\item DynamoDB
\item S3
\item Lamba and serverless applications
\item General AWS deployments and networking
\end{itemize}

\subsubsection*{Continuouse integration and deployment}
\label{sec:org891703a}

In addition to deploying applications to public clouds such as AWS I have an effective understanding of continuous deployment and integration practices. During my career, I have used multiple systems to implement build pipelines and feel confident in implementing these methodologies in any system or framework. The key products which I have utilized include:

\begin{itemize}
\item Buildkite
\item Gitlab CI
\item Bambo
\item Octopus deploy
\end{itemize}

\subsubsection*{Kubernetes}
\label{sec:org6d2a7ce}

Recently I have seen the growing need for skills in running and deploying application on Kubernetes. Though I have not yet worked with a company that is using kubernetes in a production capacity I gained experience on personal projects with the following:

\begin{itemize}
\item General kubernetes administration and application deployment
\item Helm
\item ArgoCD
\end{itemize}



\section*{Career History}
\label{sec:org8a1a2a2}

\subsection*{January 2021 - Present, SwitchdIn}
\label{sec:orgdec9ff1}

\textbf{Web Services Engineer}

Key responsibilities:

Part of a small team building web and mobile applications using Angular and Ionic. Working closely with our backend team to design and implement new features for the our main customer focused product.

\subsection*{March 2020 - Present, Mudbath}
\label{sec:org519a14e}

\textbf{Senior Software Developer}

Key responsibilities:

\begin{itemize}
\item Work with client requirements to design robust software systems
\item Write and review project documentation and designs
\item Implement code based on project requirements and brief
\item Mentor junior team members through code review and 1 on 1 coding sessions
\item Work as part of a cross functional team to meet client needs
\end{itemize}


\subsection*{June 2019 - March 2020, nib Health Funds}
\label{sec:orgf3804fc}

\textbf{Senior Software Developer}

Key responsibilities:

\begin{itemize}
\item Leading delivery teams in day to day functions
\item Mentoring of junior developers in:
\item Coding practice
\item System design and analysis
\item Work as part of cross functional team to develop software solutions for internal and external facing customers
\item Design technical solutions to meet business needs.
\item Undertake preparation tasks to scope and design solutions
\item Work with different business areas to ensure a cohesive approach to ensure design solutions meet requirements
\item Maintain applications as part of business-as-usual operations
\end{itemize}


\subsection*{2017 - June 2019, nib Health Funds}
\label{sec:orge8190ba}

\textbf{Full stack software developer}

Key responsibilities:

\begin{itemize}
\item Work as part of cross functional team to develop software solutions for internal and external facing customers
\item Design technical solutions to meet business needs.
\item Undertake preparation task to scope and design solutions
\item Work with different business areas to ensure a cohesive approach to ensure design solutions meet requirements
\item Maintain applications as part of business-as-usual operations
\end{itemize}


\subsection*{2016 - 2017, SwitchdIn}
\label{sec:orgab46965}

\textbf{Software Developer}

Key responsibilities:

\begin{itemize}
\item Design and development of web platform frontend web stack (Postgres / Django / Nginx Angular JS on Amazon web services)
\item Planning for scaling web platform
\item Troubleshooting day to day issues
\item Working with customer feedback to improve the overall experience of the web platform
\end{itemize}

\subsection*{2015 - 2016, Forsythes Information Technology}
\label{sec:org5046f7d}

\textbf{Software developer}

Key responsibilities:

\begin{itemize}
\item Working as part of a scrum team to produce web based solutions for clients
\item Full stack development using Microsoft technologies
\item Creating and maintaining internal and customer facing documentation
\item Analysis of projects from high level through to task based detail
\item Planning, Creating and maintaining customer and internal server infrastructure
\item Creating and maintaining internal continuous delivery pipeline
\end{itemize}

\subsection*{2014 - 2015, Forsythes Information Technology}
\label{sec:org06a5307}

\textbf{Level 1 Support Desk Engineer}

Key responsibilities

\begin{itemize}
\item Process and ticket management
\item Troubleshooting customer workstation and server issues
\item Troubleshooting customer network issues
\item Working as part of a larger team to maintain client infrastructure
\item Maintenance and improvement of internal and customer facing documentation
\end{itemize}


\section*{Education}
\label{sec:org1af0a51}

\subsection*{2011-2014. Newcastle University}
\label{sec:org6a4ead9}

Bachelor Information Technology
Major: Software Development and Applications

\subsection*{2009-2010. TAFE Hunter Institute.}
\label{sec:org381f20d}

Diploma of Surveying

\subsection*{Hunter School Of Performing Arts}
\label{sec:org9cd712e}

High School Certificate
\end{document}
